alplabai/gd32-bridge-firmware/hal/gd32/init.c
/* The wrapper's PUBLIC include directories expose the GigaDevice device
 * header.  It supplies the CMSIS/core definitions and pulls this project's
 * hal/gd32g5x3_libopt.h selector, which exposes the peripheral declarations
 * used by the real backend.  The vendor wrapper compiles its driver archive
 * independently; libopt controls declarations, not which driver units link. */
#include "gd32g5x3.h"
#include "gd32_common.h"

/* ----------------------------------------------------------------- */
/* Boot hooks (overrides of the weak defaults in src/main.c)         */
/* ----------------------------------------------------------------- */

/* Called once on entry to main() before the transport ISRs come online.
 * This brings up the backend's boot-global clocks, pads and peripheral
 * state; request-time operations live in the per-peripheral TUs.  There is
 * no SysTick handler -- base-level housekeeping runs after each main-loop
 * wake.  No DA9292 wiring exists on this SoM rev; see
 * bridge_hw_da9292_status_cached(). */
/* Sampled at the head of bridge_hw_init (#127); see gd32_common.h for
 * what reads them and why nothing acts on a mismatch yet.  Initialised to
 * the value the constants ASSUME so a debugger attaching before
 * bridge_hw_init has run does not read a spurious 0 and conclude the
 * clock tree is broken. */
uint32_t bridge_core_clock_hz      = PWM_TIMER_CLK_HZ;
bool     bridge_core_clock_matches = true;

void bridge_hw_init(void)
{
#if defined(BRIDGE_OTA_PARTITIONED) && defined(BRIDGE_APP_SLOT_BASE)
	/* OTA Path-A: the app runs from a flash slot, not 0x08000000, so move
     * the vector table off the vendor SystemInit default before any NVIC
     * use.  Runs first (main calls bridge_hw_init before the transports
     * enable interrupts). */
	SCB->VTOR = (uint32_t)(BRIDGE_APP_SLOT_BASE);
	__DSB();
	__ISB();
	/* The Path-A bootloader hands off with PRIMASK SET (it runs
     * __disable_irq() before swapping MSP/VTOR for the jump) -- without
     * clearing it here no interrupt ever fires in the slot app and the
     * transports go silent (silicon-caught 2026-06-04: CM33 retried init
     * 1600+ times against a slot app whose CS-EXTI could never run).
     * Re-enable now that OUR vector table is live; on a plain power-on
     * boot PRIMASK is already clear and this is a no-op. */
	__enable_irq();
#endif

	/* ORDERING (merge of #61's se_reset_init and #127's clock sample):
     * se_reset_init() goes FIRST and that is load-bearing -- see its
     * comment below on PC13 floating in ANALOG mode from reset.  The
     * clock sample that follows is a pure register read with no side
     * effects and derives nothing se_reset_init() needs (the SE reset is
     * a GPIO push-pull level, with no clock-derived timing anywhere in
     * hal/gd32/se_reset.c), so putting it second costs the #127 check
     * nothing: nothing between these two statements consumes
     * SystemCoreClock either. */
	/* Secure-element reset (SE_RST = PC13): promote it to a released-
     * level push-pull output FIRST, ahead of every other peripheral
     * bring-up below.  PC13 has no entry in `gpio_pad_map` (see
     * hal/gd32/gpio.c), so from reset until whichever statement first
     * touches it, it sits at its GPIO POR default -- ANALOG mode,
     * with the input buffer and both pull resistors disabled (UM
     * Rev1.2 p.270 §7.3.7): genuinely floating, not merely un-pulled.
     * The TRNG bring-up a few statements below this used to run first
     * and can alone spend up to ~1 ms in that state (hal/gd32/trng.c)
     * -- but that is NOT the dominant exposure: the pre-main() SramInit
     * loop floats PC13 for ~20-25 ms before bridge_hw_init() is ever
     * called (see the header comment in hal/gd32/se_reset.c for the
     * derivation).  That window is not fixable by moving this call any
     * earlier -- there is nowhere earlier in this backend to move it
     * to -- so gh#61 stays open after this reorder; this promotion
     * only bounds boot from main() onward and closes the separate
     * sub-microsecond OCTL-preload-vs-mode-promote gap inside
     * se_reset_configure() itself.  Needs only its own GPIOC clock;
     * the bulk AHB2 enable just below
     * re-enables it harmlessly for the rest of port C's pads. */
	rcu_periph_clock_enable(RCU_GPIOC);
	se_reset_init();

	/* #127: sample the clock the vendor's SystemInit() ACTUALLY left
     * running, before anything derived from it is programmed.  Until this
     * call the repo never referenced SystemCoreClock at all: every timing
     * constant in gd32_common.h -- PWM_TIMER_CLK_HZ, PWM_TIMER_PRESCALER,
     * BRIDGE_ADC_PACE_CLK_HZ, and the DWT "~4.63 ns LSB" claim in
     * counter.c -- was asserted against a number no code checked, set by a
     * SystemInit() that lives in another repository and whose variant is
     * chosen by a wrapper this repo does not own.
     *
     * SystemCoreClockUpdate() re-derives the value from the live RCU
     * registers rather than trusting the compile-time initialiser, so this
     * is the one place the firmware can find out it is running on the
     * wrong clock tree.  It is a pure register read plus arithmetic: no
     * side effects, safe this early.
     *
     * The result is recorded, not acted on.  See the declarations in
     * gd32_common.h for why refusing supervised outputs on a mismatch is
     * a follow-up rather than part of this change. */
	SystemCoreClockUpdate();
	bridge_core_clock_hz      = SystemCoreClock;
	bridge_core_clock_matches = (SystemCoreClock == PWM_TIMER_CLK_HZ);

	/* Enable AHB2 clocks for every GPIO port the pad map references.
     * The chip's RCU keeps unused GPIO ports clock-gated to save
     * power; we enable A..F unconditionally because the E1M IO map
     * spans those ports.  Port G isn't referenced by any pad. */
	rcu_periph_clock_enable(RCU_GPIOA);
	rcu_periph_clock_enable(RCU_GPIOB);
	rcu_periph_clock_enable(RCU_GPIOC);
	rcu_periph_clock_enable(RCU_GPIOD);
	rcu_periph_clock_enable(RCU_GPIOE);
	rcu_periph_clock_enable(RCU_GPIOF);

	/* Configure every entry in `gpio_pad_map` as INPUT + PULL_UP.
     * Safe default per the GPIO direction policy: no driven
     * contention with whatever the board might pull / drive on
     * those pads.  bridge_hw_gpio_write() promotes individual
     * pads to OUTPUT on demand. */
	for (size_t i = 0; i < GPIO_PAD_MAP_COUNT; ++i) {
		gpio_mode_set(
		    gpio_pad_map[i].periph, GPIO_MODE_INPUT, GPIO_PUPD_PULLUP, gpio_pad_map[i].pin);
		gpio_is_output[i] = false;
	}

	/* TRNG bring-up: configure + enable only.  The NIST pipeline's
     * first conditioned word can lag past any boot-time wait we are
     * willing to spin; readiness is promoted lazily by the first
     * TRNG_READ's short DRDY poll (by which point the host's boot
     * settle has given the analog source seconds, not milliseconds). */
	trng_started = trng_start();
	if (trng_started) {
		/* Boot-time readiness grace: the transports aren't up yet, so
         * spending a few milliseconds here is free and spares the
         * FIRST host TRNG_READ the one-time conditioning latency
         * (observed on the functional tier: the inaugural read paid
         * the promotion and answered STATUS_IO once).  Bounded; the
         * lazy per-read path remains the safety net. */
		for (unsigned round = 0u; round < 8u && trng_started && !trng_ready; ++round) {
			(void)trng_poll_ready();
		}
	}

	/* TMU clock enable.  Per-op configuration happens in
     * bridge_hw_tmu_compute because the mode + I/O width vary per
     * call. */
	rcu_periph_clock_enable(RCU_TMU);

