alplabai/gd32-bridge-firmware/hal/gd32/init.c
void bridge_hw_tick(void)
{
	bridge_hw_dsp_pump();
	ota_erase_tick();
	bridge_power_tick();
}

/* ----------------------------------------------------------------- */
/* Stub bodies -- shape mirrors bridge_hw_stub.c so the gd32 backend  */
/* is binary-compatible with the stub backend pending real impls.    */
/* ----------------------------------------------------------------- */

uint8_t bridge_hw_reset_reason(void)
{
	/* Read RCU_RSTSCK (reset/clock control status register, GD32G5xx
     * Reference Manual §6.6.13) and decode the sticky reset-cause
     * flags in the high byte: PORRSTF (bit 27), BORRSTF (25),
     * EPRSTF (26, NRST pin), SWRSTF (28), FWDGTRSTF (29),
     * WWDGTRSTF (30), LPRSTF (31).
     *
     * The hardware can latch multiple flags across nested resets, so
     * we decode in coldest-first priority order: a power-on event
     * dominates a brownout, which dominates an external-pin reset,
     * which dominates a watchdog or software trigger.  Encoded byte
     * matches the host's `gd32g553_reset_cause_t` in
     * <alp/chips/gd32g553.h>:
     *
     *   0 = UNKNOWN, 1 = POWER_ON, 2 = NRST_PIN, 3 = SOFT,
     *   4 = WDT, 5 = BROWNOUT, 6 = LOWPOWER.
     *
     * RSTFC (bit 24) clears every cause flag in one write; the vendor
     * helper `rcu_all_reset_flag_clear()` is functionally identical
     * but we keep the access inline to avoid pulling rcu.c stages we
     * don't otherwise need.  After the write the next reader sees
     * UNKNOWN unless something resets the chip again. */
	const uint32_t rstsck = RCU_RSTSCK;
	uint8_t        cause  = 0u; /* UNKNOWN */

	if (rstsck & RCU_RSTSCK_PORRSTF) {
		cause = 1u; /* POWER_ON */
	} else if (rstsck & RCU_RSTSCK_BORRSTF) {
		cause = 5u; /* BROWNOUT */
	} else if (rstsck & RCU_RSTSCK_EPRSTF) {
		cause = 2u; /* NRST_PIN */
	} else if (rstsck & RCU_RSTSCK_LPRSTF) {
		cause = 6u; /* LOWPOWER */
	} else if (rstsck & (RCU_RSTSCK_FWDGTRSTF | RCU_RSTSCK_WWDGTRSTF)) {
		cause = 4u; /* WDT */
	} else if (rstsck & RCU_RSTSCK_SWRSTF) {
		cause = 3u; /* SOFT */
	}

	RCU_RSTSCK |= RCU_RSTSCK_RSTFC;
	return cause;
}

uint8_t bridge_hw_da9292_status_cached(void)
{
	/* 0xFF sentinel unconditionally: no DA9292 net reaches the GD32 on
     * this SoM rev (fault pins are Renesas P37/P36 inputs). */
	return 0xFFu;
}
